# Pandas

Pandas is a very popular Python library that is used for data analysis, which is the second step of the Data Science lifecycle. It offers functionalities to handle and manipulate data very efficiently. It has been widely adopted by people who are not computer scientists or programmers as it makes them move beyond Excel for analyzing data. We will be using Pandas in this course for all of our analyses.

In [2]:
import pandas as pd

In [4]:
###pd.series type ya pd.Dataframe type object
l=['Arpita','Nitish','Jitender','Nitish']
df_from_list=pd.Series(l)
type(df_from_list)

pandas.core.series.Series

In [5]:
author=['Nitish','Purnima','jitender','jyoti']
article=[210,123,124,125]
frame={'Author':author,'Article':article}

pd.DataFrame(frame)

     Author  Article
0    Nitish      210
1   Purnima      123
2  jitender      124
3     jyoti      125

In [10]:
df=pd.read_csv('housing.csv')

In [15]:
##df.longitude.head()
df['longitude'].head()

0   -122.23
1   -122.22
2   -122.24
3   -122.25
4   -122.25
Name: longitude, dtype: float64

In [20]:
print(len(df.columns))

10

In [19]:
df.shape[0]

20640

In [23]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [32]:
cols_to_select=['longitude','latitude','housing_median_age','total_rooms','total_bedrooms']

new_df=df[cols_to_select]

In [44]:
rows_to_select=[0,1,2,3,4]
df.loc[rows_to_select,cols_to_select]

-122.23

In [46]:
new_df=df.loc[0:5,cols_to_select]

In [48]:
##assignment
df.loc[0,'longitude']=0

In [52]:
df.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.563782,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.169441,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,0.000000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
ocean_proximity        object
dtype: object

In [47]:
new_df.head()

   longitude  latitude  housing_median_age  total_rooms  total_bedrooms
0    -122.23     37.88                41.0        880.0           129.0
1    -122.22     37.86                21.0       7099.0          1106.0
2    -122.24     37.85                52.0       1467.0           190.0
3    -122.25     37.85                52.0       1274.0           235.0
4    -122.25     37.85                52.0       1627.0           280.0

In [ ]:
##def display_all(df):
    ###with pd.option_context("display.max_rows", 1000, "display.max_columns", 1000): 
        ##display(df)

In [63]:
###filtering the dat
df.ocean_proximity.unique()
df.ocean_proximity.nunique()
df.ocean_proximity.value_counts()

<1H OCEAN     9136
INLAND        6551
NEAR OCEAN    2658
NEAR BAY      2290
ISLAND           5
Name: ocean_proximity, dtype: int64

In [64]:
condition=df['ocean_proximity']=='NEAR OCEAN'

In [69]:
filtered_df=df[condition]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
1850,-124.17,41.80,16.0,2739.0,480.0,1259.0,436.0,3.7557,109400.0,NEAR OCEAN
1851,-124.30,41.80,19.0,2672.0,552.0,1298.0,478.0,1.9797,85800.0,NEAR OCEAN
1852,-124.23,41.75,11.0,3159.0,616.0,1343.0,479.0,2.4805,73200.0,NEAR OCEAN
1853,-124.21,41.77,17.0,3461.0,722.0,1947.0,647.0,2.5795,68400.0,NEAR OCEAN
1854,-124.19,41.78,15.0,3140.0,714.0,1645.0,640.0,1.6654,74600.0,NEAR OCEAN

In [71]:
condition2=df['population']<100
filtered_df_2=df[condition2]

In [74]:
filtered_df_2.ocean_proximity.value_counts()

INLAND        126
<1H OCEAN      54
NEAR BAY       30
NEAR OCEAN     24
Name: ocean_proximity, dtype: int64

In [80]:
condition_3=(df['population']>1300) & (df['households']<500)

In [84]:
print(condition_3)

0        False
1        False
2        False
3        False
4        False
         ...
20635    False
20636    False
20637    False
20638    False
20639    False
Length: 20640, dtype: bool

In [81]:
filtered_df=df[condition_3]

In [82]:
filtered_df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
94,-122.27,37.80,39.0,1715.0,623.0,1327.0,467.0,1.8477,179200.0,NEAR BAY
169,-122.25,37.79,45.0,1786.0,526.0,1475.0,460.0,1.7772,97500.0,NEAR BAY
179,-122.24,37.80,52.0,1803.0,420.0,1321.0,401.0,2.9570,122800.0,NEAR BAY
186,-122.23,37.79,52.0,1783.0,395.0,1659.0,412.0,2.9357,107900.0,NEAR BAY
188,-122.24,37.79,39.0,1469.0,431.0,1464.0,389.0,2.1638,105500.0,NEAR BAY

In [87]:
def convert2(value):
    value=value*-1
    return value
new_column=df['longitude'].apply(convert2)

In [88]:
df['abc']=new_column

In [89]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,abc
0,0.00,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY,-0.00
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY,122.22
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY,122.24
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY,122.25
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY,122.25

In [92]:
###agggregation
df['households'].sum()
df['households'].min()

1.0

In [94]:
df['total_bedrooms'].max()

6445.0

In [95]:
##Grouping the data
cols_select=['latitude','ocean_proximity']
new_df=df[cols_select]

In [98]:
new_df.groupby('ocean_proximity').mean()

                  latitude
ocean_proximity
<1H OCEAN        34.560577
INLAND           36.731829
ISLAND           33.358000
NEAR BAY         37.801057
NEAR OCEAN       34.738439

array(['NEAR BAY', '<1H OCEAN', 'INLAND', 'NEAR OCEAN', 'ISLAND'],
      dtype=object)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,0.00,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,0.00,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20502,-118.68,34.33,45.0,121.0,25.0,67.0,27.0,2.9821,325000.0,<1H OCEAN
20503,-118.75,34.33,27.0,534.0,85.0,243.0,77.0,8.2787,330000.0,<1H OCEAN
20504,-118.73,34.29,11.0,5451.0,736.0,2526.0,752.0,7.3550,343900.0,<1H OCEAN
20505,-118.72,34.29,22.0,3266.0,529.0,1595.0,494.0,6.0368,248000.0,<1H OCEAN
20506,-118.73,34.29,8.0,4983.0,754.0,2510.0,725.0,6.9454,276500.0,<1H OCEAN

In [ ]:
###replace method

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
6066,-117.87,34.04,7.0,27700.0,4179.0,15037.0,4072.0,6.6288,339700.0,<1H OCEAN
15360,-117.42,33.35,14.0,25135.0,4819.0,35682.0,4769.0,2.5729,134400.0,<1H OCEAN

0    832520.0
1    830140.0
2    725740.0
3    564310.0
4    384620.0
Name: median_income, dtype: float64

# Filtering the data
Filtering is the process of extracting a subset of your data based on some condition or constraint. These conditions can be on the values that the data items take. We filter data when we wish to look at a smaller part of the whole data. For instance, we may want:

the data in a particular period of the year

the data of the highest selling items

the data for a specific group of items

to remove extra or useless data

Aggregation
Aggregation is the procedure of converting a large number of values, or a dataset, into a single value or quantity aimed to summarize or describe the data. During data analysis, we always want to summarize data in one way or another. When we take a sum, count the number of items, or take the average of some values we aggregate data. Common aggregation methods are:

sum
count
maximum
minimum
average

In [17]:
####grouping the data